## Production: glue 🧴
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 2 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                           NAME                            |
|--------|-----------------------------------------------------------|
| add    | `aws_glue_crawler.platform_gc_forms_templates_production` |
|        | `aws_s3_object.bes_crm_salesforce_requirements`           |
| delete | `aws_glue_crawler.platform_gc_forms_forms_production`     |
|        | `aws_glue_job.forms_generate_test_data`                   |
|        | `aws_s3_object.forms_generate_test_data`                  |
| update | `aws_glue_job.bes_crm_salesforce`                         |
|        | `aws_s3_object.bes_crm_salesforce_job`                    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_glue_crawler.platform_gc_forms_forms_production will be destroyed
  # (because aws_glue_crawler.platform_gc_forms_forms_production is not in configuration)
  - resource "aws_glue_crawler" "platform_gc_forms_forms_production" {
      - arn                    = "arn:aws:glue:ca-central-1:739275439843:crawler/Platform / GC Forms / Forms" -> null
      - classifiers            = [] -> null
      - configuration          = jsonencode(
            {
              - CrawlerOutput        = {
                  - Tables = {
                      - TableThreshold = 3
                    }
                }
              - CreatePartitionIndex = true
              - Version              = 1.0
            }
        ) -> null
      - database_name          = "platform_gc_forms_production" -> null
      - description            = "Classify the GC Forms forms (template) data" -> null
      - id                     = "Platform / GC Forms / Forms" -> null
      - name                   = "Platform / GC Forms / Forms" -> null
      - role                   = "service-role/AWSGlueCrawler-DataLake" -> null
      - security_configuration = "encryption-at-rest" -> null
      - table_prefix           = "forms_" -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "CostCentre" = "PlatformDataLake"
          - "Terraform"  = "true"
        } -> null
        # (1 unchanged attribute hidden)

      - lake_formation_configuration {
          - use_lake_formation_credentials = false -> null
            # (1 unchanged attribute hidden)
        }

      - lineage_configuration {
          - crawler_lineage_settings = "DISABLE" -> null
        }

      - recrawl_policy {
          - recrawl_behavior = "CRAWL_EVERYTHING" -> null
        }

      - s3_target {
          - exclusions          = [] -> null
          - path                = "s3://cds-data-lake-transformed-production/platform/gc-forms/forms" -> null
          - sample_size         = 0 -> null
            # (3 unchanged attributes hidden)
        }

      - schema_change_policy {
          - delete_behavior = "DEPRECATE_IN_DATABASE" -> null
          - update_behavior = "UPDATE_IN_DATABASE" -> null
        }
    }

  # aws_glue_crawler.platform_gc_forms_templates_production will be created
  + resource "aws_glue_crawler" "platform_gc_forms_templates_production" {
      + arn                    = (known after apply)
      + configuration          = jsonencode(
            {
              + CrawlerOutput        = {
                  + Tables = {
                      + TableThreshold = 3
                    }
                }
              + CreatePartitionIndex = true
              + Version              = 1
            }
        )
      + database_name          = "platform_gc_forms_production"
      + description            = "Classify the GC Forms template data"
      + id                     = (known after apply)
      + name                   = "Platform / GC Forms / Templates"
      + role                   = "arn:aws:iam::739275439843:role/service-role/AWSGlueCrawler-DataLake"
      + security_configuration = "encryption-at-rest"
      + table_prefix           = "forms_"
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + s3_target {
          + path = "s3://cds-data-lake-transformed-production/platform/gc-forms"
        }
    }

  # aws_glue_job.bes_crm_salesforce will be updated in-place
  ~ resource "aws_glue_job" "bes_crm_salesforce" {
      ~ default_arguments         = {
          + "--additional-python-modules"        = "s3://cds-data-lake-glue-production/bes/crm/salesforce/requirements.txt"
          + "--python-modules-installer-option"  = "-r"
            # (15 unchanged elements hidden)
        }
      + execution_class           = "FLEX"
        id                        = "BES / CRM / Salesforce"
        name                      = "BES / CRM / Salesforce"
        tags                      = {}
        # (15 unchanged attributes hidden)

      ~ command {
            name            = "pythonshell"
          ~ python_version  = "3.9" -> "3"
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_glue_job.forms_generate_test_data will be destroyed
  # (because aws_glue_job.forms_generate_test_data is not in configuration)
  - resource "aws_glue_job" "forms_generate_test_data" {
      - arn                       = "arn:aws:glue:ca-central-1:739275439843:job/Platform / GC Forms / Generate test data" -> null
      - connections               = [] -> null
      - default_arguments         = {
          - "--continuous-log-logGroup"          = "/aws-glue/jobs/encryption-at-rest/service-role/AWSGlueETL-DataLake/output"
          - "--continuous-log-logStreamPrefix"   = "forms_generate_test_data"
          - "--enable-continuous-cloudwatch-log" = "true"
          - "--enable-continuous-log-filter"     = "true"
          - "--enable-metrics"                   = "true"
          - "--enable-observability-metrics"     = "true"
          - "--num_partitions"                   = "1"
          - "--output_s3_path"                   = "s3://cds-data-lake-transformed-production/platform/gc-forms/forms/test/"
        } -> null
      - glue_version              = "4.0" -> null
      - id                        = "Platform / GC Forms / Generate test data" -> null
      - job_run_queuing_enabled   = false -> null
      - max_capacity              = 10 -> null
      - max_retries               = 0 -> null
      - name                      = "Platform / GC Forms / Generate test data" -> null
      - non_overridable_arguments = {} -> null
      - number_of_workers         = 10 -> null
      - role_arn                  = "arn:aws:iam::739275439843:role/service-role/AWSGlueETL-DataLake" -> null
      - security_configuration    = "encryption-at-rest" -> null
      - tags                      = {} -> null
      - tags_all                  = {
          - "CostCentre" = "PlatformDataLake"
          - "Terraform"  = "true"
        } -> null
      - timeout                   = 15 -> null
      - worker_type               = "G.1X" -> null
        # (3 unchanged attributes hidden)

      - command {
          - name            = "glueetl" -> null
          - python_version  = "3" -> null
          - script_location = "s3://cds-data-lake-glue-production/platform/gc-forms/generate_test_data.py" -> null
            # (1 unchanged attribute hidden)
        }

      - execution_property {
          - max_concurrent_runs = 1 -> null
        }
    }

  # aws_s3_object.bes_crm_salesforce_job will be updated in-place
  ~ resource "aws_s3_object" "bes_crm_salesforce_job" {
      ~ etag                          = "78c0b0a7ddf6b48c0c518cf9db44bf12" -> "c4a8987c655b7f44ab8601562caa89ab"
        id                            = "bes/crm/salesforce/process_salesforce.py"
        tags                          = {}
      ~ version_id                    = "ZykWPthiXKBzKaz6uowK51vdLailclge" -> (known after apply)
        # (23 unchanged attributes hidden)
    }

  # aws_s3_object.bes_crm_salesforce_requirements will be created
  + resource "aws_s3_object" "bes_crm_salesforce_requirements" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "cds-data-lake-glue-production"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "94d18cc6f3c8e50a1e3a988e78e6a849"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "bes/crm/salesforce/requirements.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./etl/bes/crm/scripts/requirements.txt"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.forms_generate_test_data will be destroyed
  # (because aws_s3_object.forms_generate_test_data is not in configuration)
  - resource "aws_s3_object" "forms_generate_test_data" {
      - arn                           = "arn:aws:s3:::cds-data-lake-glue-production/platform/gc-forms/generate_test_data.py" -> null
      - bucket                        = "cds-data-lake-glue-production" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "application/octet-stream; charset=UTF-8" -> null
      - etag                          = "41a28d43ff5059f34c1a64c84ff980dd" -> null
      - force_destroy                 = false -> null
      - id                            = "platform/gc-forms/generate_test_data.py" -> null
      - key                           = "platform/gc-forms/generate_test_data.py" -> null
      - metadata                      = {} -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "./etl/platform/gc-forms/scripts/generate_test_data.py" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {} -> null
      - tags_all                      = {
          - "CostCentre" = "PlatformDataLake"
          - "Terraform"  = "true"
        } -> null
      - version_id                    = "KL9EejDIn4b7T220WZ4nKWbucl2oeIaK" -> null
        # (12 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.bes_crm_salesforce_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.bes_crm_salesforce_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_account_tags"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_cost_usage_report"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_gc_forms_templates_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_support_freshdesk_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.bes_crm_salesforce"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.platform_support_freshdesk"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_trigger.bes_crm_salesforce"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_trigger.platform_support_freshdesk"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.aws_glue"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
